Revit 2024 API
IndexBuffer Methods
The IndexBuffer type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetIndexStreamLine
 Gets a stream that can be used to write IndexLine segment primitives into the buffer.
GetIndexStreamPoint
 Gets a stream that can be used to write IndexPoint primitives into the buffer.
GetIndexStreamTriangle
 Gets a stream that can be used to write IndexTriangle primitives into the buffer.
GetMappedHandle
 Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValid
 Tests whether the buffer is valid for rendering.
Map
 Maps a portion of the index buffer into memory, so that indices can be written into it. see IndexStream.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Unmap
 Unmaps the buffer so that it can be used for rendering.
See Also
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace